tsung_test/1.xml
<?xml version="1.0"?>
<!-- MacOS: <!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" []> -->
<!-- MacOS _2: <!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" []> -->
<!-- LINUX: <!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] > -->
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" []>

<!--
    loglevel for high load -> "warning"
    dumptraffic="protocol" logs all requests in a CSV file
-->
<tsung loglevel="notice" dumptraffic="protocol" version="1.0">
    
    <!-- CLIENTS -->
    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>

    <!-- SERVERS -->
    <servers>
        <!-- Blockchain server -->
        <!--<server host="192.168.1.100" port="8000" type="tcp"></server>-->
        <!-- Application server -->
        <server host="127.0.0.1" port="5000" type="tcp"></server>
    </servers>
    
    <!-- MONITORS -->
    <monitoring>
        <monitor host="127.0.0.1" type="snmp"></monitor>
    </monitoring>
    
    
    
    <!-- LOADS -->
    <load duration="30" unit="minute">   <!-- whole experiment is 30 minutes -->
        <!-- 35' to be sure not to relax the server after the 30' choosen before for the experiment-->
        <arrivalphase phase="1" duration="5" unit="minute">
            <users maxnumber="1" interarrival="0.01" unit="second"></users>
        </arrivalphase>
        
        <arrivalphase phase="2" duration="30" unit="minute">
            <!-- Limited to 1 user -->
            <!-- Rate = 1/interArrivalValue -->
            <users maxnumber="1" interarrival="0.01" unit="second"></users>
            <!-- <users maxnumber="1" arrivalrate="100" unit="second"></users> -->
        </arrivalphase>
    </load>
    
    
    
    <!-- OPTIONS -->
    <options>        
        <option type="ts_http" name="user_agent">
            <user_agent probability="30">
                Mozilla/5.0 (X11; Ubuntu; Linux i686; rv:24.0) Gecko/20100101 Firefox/24.0
            </user_agent>
            <user_agent probability="20">
                Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.138 Safari/537.36
            </user_agent>
            <user_agent probability="40">
                Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.138 Safari/537.36
            </user_agent>
            <user_agent probability="5">
                Mozilla/5.0 (iPhone; CPU iPhone OS 13_4 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) CriOS/81.0.4044.124 Mobile/15E148 Safari/604.1
            </user_agent>
            <user_agent probability="5">
                Mozilla/5.0 (Linux; U; Android 2.2) AppleWebKit/533.1 (KHTML, like Gecko) Version/4.0 Mobile Safari/533.1
            </user_agent>  
        </option>
    </options>
    
    
    
    <!-- SESSIONS -->
    <sessions>
            
            <!-- Add record -->
            <session name="add_record" probability="30" type="ts_http">
                <request>
                    <http url="/add_record" method="GET" version="1.1"></http>
                </request>
                
                <request>
                    <http url="/add_record" method="POST" version="1.1"
                          contents_from_file='contents_add_record.txt'></http>
                </request>
            </session>

            <!-- Flight status -->
            <session name="flight_status" probability="30" type="ts_http">
                <!--<setdynvars sourcetype="file" fileid="flight_status.csv" delimiter=";" order="iter">
                    <var name="date" />
                    <var name="opcarrierflnum" />
                </setdynvars>-->
                
                <request subst="true">
                    <http url="/query_status" method="GET" version="1.1"></http>
                </request>

                <request>
                    <http url="/query_status" method="POST" version="1.1"
                          contents='date=2010-01-19&amp;op_carrier_fl_num=719'
                          ></http>
                </request>
            </session>

            <!-- Average delay -->
            <session name="average_delay" probability="20" type="ts_http">
                <request>
                    <http url="/query_delay" method="GET" version="1.1"></http>
                </request>

                <request>
                    <http url="/query_delay" method="POST" version="1.1"
                          contents='op_carrier_fl_num=1908&amp;start_time=2010-01-01&amp;end_time=2010-01-31'></http>
                </request>
            </session>

            <!-- Count flights -->
            <session name="count_flights" probability="20" type="ts_http">
                <request>
                    <http url="/count_flight" method="GET" version="1.1"></http>
                </request>

                <request>
                    <http url="/count_flight" method="POST" version="1.1"
                          contents='first_date=2010-01-01&amp;second_date=2010-01-31&amp;first_city=Detroit,%20MI&amp;second_city=Miami,%20FL'></http>
                </request>
            </session>
        
    </sessions>
</tsung>

<!-- AFTER THE BENCHMARK RUN IN THE DIRECTORY /usr/local/lib/tsung/bin/tsung_stats.pl -->